[
{"title": "Data Structures and Algorithms | Udacity", "description": "This program will help you gain an in-depth understanding of data structures and algorithms through 100+ practice problems and dedicated mentor support. Learn by doing as you practice with both defined and open-ended questions.\n\nThis practice will help you learn to design elegant solutions to new and open-ended problems.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": []},
{"title": "Mobile Web Specialist | Udacity", "description": "As a graduate of this program, you'll be job-ready for Mobile Web Developer roles. In addition, you'll be fully prepared to earn the Google Mobile Web Specialist Certification, offered directly by Google.\n", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": []},
{"title": "Deep Learning | Udacity", "description": "In this program, you’ll cover Convolutional and Recurrent Neural Networks, Generative Adversarial Networks, Deployment, and more. You’ll use PyTorch, and have access to GPUs to train models faster. You'll learn from authorities like Sebastian Thrun, Ian Goodfellow, Jun-Yan Zhu, and Andrew Trask. This is the ideal point-of-entry into the field of AI.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Mat Leonard", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mat is a former physicist, research neuroscientist, and data scientist. He did his PhD and Postdoctoral Fellowship at the University of California, Berkeley."}, {"name": "Luis Serrano", "job": "Head of Content", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Cezanne Camacho", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is a computer vision expert with a Masters in Electrical Engineering from Stanford University. As a former genomics and biomedical imaging researcher, she’s applied computer vision and deep learning to medical diagnostics."}, {"name": "Alexis Cook", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Alexis is an applied mathematician with a Masters in computer science from Brown University and a Masters in applied mathematics from the University of Michigan. She was formerly a National Science Foundation Graduate Research Fellow."}, {"name": "Jennifer Staab", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jennifer has a PhD in Computer Science, Masters in Biostatistics, and was a professor at Florida Polytechnic University. She previously worked at RTI International and United Therapeutics as a statistician and computer scientist."}, {"name": "Sean Carrell", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sean Carrell is a former research mathematician specializing in Algebraic Combinatorics. He completed his PhD and Postdoctoral Fellowship at the University of Waterloo, Canada."}, {"name": "Ortal Arel", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Ortal Arel is a former computer engineering professor. She holds a  Ph.D. in Computer Engineering from the University of Tennessee. Her doctoral research work was in the area of applied cryptography."}, {"name": "Jay Alammar", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jay is a software engineer, the founder of Qaym (an Arabic-language review site), and the Investment Principal at STV, a $500 million venture capital fund focused on high-technology startups."}]},
{"title": "Programming for Data Science | Udacity", "description": "In this program, you’ll learn the most valuable programming tools and languages used by data scientists today. You’ll learn how to manipulate large datasets, perform version control, and access modern databases. You’ll select the track in either Python or R, two of the most popular programming languages used by Data Scientists today. This program is an ideal way to launch a career in data, and for experienced analysts, it’s an excellent opportunity to augment your existing skill set with in-demand programming skills.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": []},
{"title": "VR Foundations | Udacity", "description": "If you're an aspiring VR professional who is ready to establish the right fundamentals for building a full range of career-ready skills, we recommend enrolling in our VR Foundations Nanodegree program. You'll learn from industry experts like Google, Unity, and HTC, and acquire valuable proficiency with the Unity game engine, and C#.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Christian Plagemann", "job": "Curriculum Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Christian co-founded the VR Team at Google, started the VR Nanodegree program at Udacity, and developed this VR curriculum together with our partners and the team."}, {"name": "Matt Sonic", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Matt is a serial entrepreneur, artist, engineer, and founder of SFVR. His specialties are: virtual reality, computer graphics, interaction design, and high-performance programming."}, {"name": "Vasanth Mohan", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Vasanth previously worked at Stanford's Virtual-Human Interaction Lab. In addition to Udacity, he is working on an initiative called FusedVR, to help raise VR awareness and inspire more people to get started creating content."}, {"name": "Chris Birke", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Chris Birke is an experienced game developer devoted to GPU programming, procedural generation, and emergent technologies for VR, who hopes to bring new life and expression to future digital worlds."}]},
{"title": "AI Programming with Python | Udacity", "description": "Learning to program with Python, one of the most widely used languages in Artificial Intelligence, is the core of this program. You’ll also focus on neural networks—AI’s main building blocks. By learning foundational AI and math skills, you lay the groundwork for advancing your career—whether you’re just starting out, or readying for a full-time role.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Ortal Arel", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Ortal Arel has a PhD in Computer Engineering, and has been a professor and researcher in the field of applied cryptography. She has worked on design and analysis of intelligent algorithms for high-speed custom digital architectures."}, {"name": "Luis Serrano", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Jennifer Staab", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jennifer has a PhD in Computer Science, Masters in Biostatistics, and was a professor at Florida Polytechnic University. She previously worked at RTI International and United Therapeutics as a statistician and computer scientist."}, {"name": "Juan Delgado", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Juan is a computational physicist with a Masters in Astronomy. He is finishing his PhD in Biophysics. He previously worked at NASA developing space instruments and writing software to analyze large amounts of scientific data using machine learning techniques."}, {"name": "Grant Sanderson", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Grant Sanderson is the creator of the YouTube channel 3Blue1Brown, which is devoted to teaching math visually, using a custom-built animation tool. He was previously a content creator for Khan Academy."}, {"name": "Mat Leonard", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mat is a former physicist, research neuroscientist, and data scientist. He did his PhD and Postdoctoral Fellowship at the University of California, Berkeley."}, {"name": "Mike Yi", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mike is a Content Developer with a BS in Mathematics and Statistics. He received his PhD in Cognitive Science from the University of Irvine. Previously, he worked on Udacity's Data Analyst Nanodegree program as a support lead."}, {"name": "Juno Lee", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As a data scientist at Looplist, Juno built neural networks to analyze and categorize product images, a recommendation system to personalize shopping experiences for each user, and tools to generate insight into user behavior."}, {"name": "Andrew Paster", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andrew has an engineering degree from Yale, and has used his data science skills to build a jewelry business from the ground up. He has additionally created courses for Udacity’s Self-Driving Car Engineer Nanodegree program."}]},
{"title": "Business Analytics | Udacity", "description": "This program is for anyone who wishes to gain foundational data skills that are applicable to virtually all fields. You’ll learn to collect, organize, and analyze data with Excel and SQL; build Excel models to analyze possible business outcomes; and visualize and communicate your findings using Tableau. This program is an ideal choice whether you’re just getting started with data, are interested in applying data skills to your current role, or plan to pursue further studies or career goals.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Josh Bernhard", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Josh has been sharing his passion for data for nearly a decade at all levels of university, and as Lead Data Science Instructor at Galvanize. He's used data science for work ranging from cancer research to process automation."}, {"name": "Dana Sheahen", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Dana is an electrical engineer with a Masters in Computer Science from Georgia Tech. Her work experience includes software development for embedded systems in the Automotive Group at Motorola, where she was awarded a patent for an onboard operating system."}, {"name": "Mat Leonard", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mat is a former physicist, research neuroscientist, and data scientist. He did his PhD and Postdoctoral Fellowship at the University of California, Berkeley."}, {"name": "Derek Steer", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Derek is the CEO of Mode Analytics. He developed an analytical foundation at Facebook and Yammer and is passionate about sharing it with future analysts. He authored SQL School and is a mentor at Insight Data Science."}, {"name": "Sam Nelson", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sam is the Product Lead for Udacity’s Data Analyst, Business Analyst, and Data Foundations programs. He’s worked as an analytics consultant on projects in several industries, and is passionate about helping others improve their data skills."}]},
{"title": "Data Scientist | Udacity", "description": "Data science skills are in high demand, and you'll finish this program with practical skills needed to land a data science job. You'll build projects designed with our industry partners using real-world data, and by the end of the program you will be able to build machine learning models includng supervised and unsupervised methods; create and run data pipelines; design experiments; build recommendation systems; deploy solutions to the cloud; and more. This program is an ideal way to move into a data science career, and by the end of the program you'll be ready to apply for data science jobs.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Josh Bernhard", "job": "Data Science Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Josh has been sharing his passion for data for nearly a decade at all levels of university, and as Lead Data Science Instructor at Galvanize. He's used data science for work ranging from cancer research to process automation."}, {"name": "Juno Lee", "job": "Data Science Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As a data scientist, Juno built a recommendation engine to personalize online shopping experiences, computer vision and natural language processing models to analyze product data, and tools to generate insight into user behavior."}, {"name": "Luis Serrano", "job": "Machine Learning Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Andrew Paster", "job": "Data Science Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andrew has an engineering degree from Yale, and has used his data science skills to build a jewelry business from the ground up. He has additionally created courses for Udacity’s Self-Driving Car Engineer Nanodegree program."}, {"name": "Mike Yi", "job": "Data Science Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mike is a content developer with a multidisciplinary academic background, including math, statistics, physics, and psychology. Previously, he worked on Udacity's Data Analyst Nanodegree program as a support lead."}]},
{"title": "React | Udacity", "description": "React is a powerful JavaScript library ideal for building interactive, data-driven user interfaces, and it’s used by some of the most successful brands in the world, including Facebook, Netflix, Airbnb, and more.", "image": null, "instructor": [{"name": "Andrew Wong", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andrew is a Course Developer who enjoys making the world a better place through code. He first discovered his passion for teaching as an instructor at App Academy, and continues to enjoy empowering students to advance their education."}, {"name": "Tyler McGinnis", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Tyler found his love for teaching at DevMountain, where he was lead instructor and curriculum engineer. He's a Google Developer Expert and is entrenched in the React community organizing React Utah, and running React Newsletter."}, {"name": "Richard Kalehoff", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Richard is a Course Developer with a passion for teaching. He has a degree in computer science, and first worked for a nonprofit doing everything from front-end web development, to backend programming, to database and server management."}]},
{"title": "VR Mobile 360 | Udacity", "description": "In this program, you’ll start shooting your own 360 immersive films, master 360 video stitching, and learn audio capture options as you advance towards your capstone project, in which you create your very own VR project using all your Unity Game Engine and C# skills. It’s the ideal program for anyone eager to combine creativity and technical skill to produce cutting-edge 360 VR content for mobile.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Christian Plagemann", "job": "Curriculum Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Christian co-founded the VR Team at Google, started the VR Nanodegree program at Udacity, and developed this VR curriculum together with our partners and the team."}, {"name": "Matt Sonic", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Matt is a serial entrepreneur, artist, engineer, and founder of SFVR. His specialties are: virtual reality, computer graphics, interaction design, and high-performance programming."}, {"name": "Austin McCasland", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Austin is a virtual reality user experience designer. His background is in interactive sculptural new media, and he has a Masters degree in Human-Computer Interaction from Carnegie Mellon University."}, {"name": "Suzanne Leibrick", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Suzanne is an independent VR designer. She is also a cofounder of ARVR Academy, a non-profit that teaches women VR and AR development at low cost, and aims to create gender parity in the VR and AR industry in 5 years."}]},
{"title": "Digital Marketing | Udacity", "description": "This program offers you the opportunity to master platform-specific skills valued by top employers, while at the same time establishing a broad-based understanding of the whole digital marketing ecosystem. After graduating, you'll be ready to join a large corporation or a small firm, or even go independent as a freelance digital marketer.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Anke Audenaert", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Anke is the team lead for the Digital Marketing Nanodegree program at Udacity.  She previously ran Market Research at Yahoo!, co-founded two companies, and is on the marketing faculty at UCLA Anderson."}, {"name": "Daniel Kob", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Dan is a digital media entrepreneur, visual storyteller, and Stanford MBA. He has worked in different roles in media, tech, and marketing in Europe and the US."}, {"name": "Julia Aspinal", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Julia is a digital marketer, front end engineer, and former Teach for America teacher. She has worked in marketing, product management, and web development roles at Scholastic, Udacity, and other companies."}]},
{"title": "Self Driving Car Engineer Nanodegree | Udacity", "description": "If your goal is to learn the skills necessary to become a self-driving car engineer, and then secure a rewarding role in the field where you can start applying those skills, this program is the ideal choice. The Self-Driving Car Engineer Nanodegree program is one of the only programs in the world that both teaches you the right skills, and supports you in obtaining a job.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Sebastian Thrun", "job": "Udacity President", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Scientist, educator, inventor, and entrepreneur, Sebastian led the self-driving car project at Google X and founded Udacity, whose mission is to democratize education by providing lifelong, on-demand learning to millions of students around the world."}, {"name": "David Silver", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "David Silver leads the Self-Driving Car Engineer Nanodegree Program. Before Udacity, David was a research engineer on the autonomous vehicle team at Ford. He has an MBA from Stanford, and a BSE in computer science from Princeton."}, {"name": "Ryan Keenan", "job": "Course Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Ryan has a PhD in Astrophysics and a passion for teaching and learning. He is also a lead instructor in the Robotics Nanodegree program. When he’s not building Udacious learning content you’ll find him up in the mountains or out in the surf."}, {"name": "Cezanne Camacho", "job": "Course Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is an expert in computer vision with an M.S. in Electrical Engineering from Stanford University. Inspired by anyone with the drive and imagination to learn something new, she aims to create more inclusive and effective STEM education."}, {"name": "Mercedes-Benz", "job": "Mercedes-Benz Team", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mercedes-Benz R&D North America develops the world’s most advanced automotive technology and vehicle design with luxury and style. The team from Mercedes built our Sensor Fusion, Localization, and Path Planning content."}, {"name": "NVIDIA", "job": "Nvidia Team", "image": "/assets/iridium/images/shared/placeholder.png", "description": "NVIDIA is a company built upon great minds and groundbreaking research. GPU deep learning has ignited modern AI - the next era of computing - with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world."}, {"name": "Uber ATG", "job": "Uber ATG Team", "image": "/assets/iridium/images/shared/placeholder.png", "description": "The Advanced Technologies Group is comprised of Uber’s self-driving engineering team dedicated to self-driving technologies, mapping, and vehicle safety."}]},
{"title": "Machine Learning Engineer | Udacity", "description": "In this program, you’ll master valuable machine learning skills that are in demand across countless industries. Investment levels in this space continue to rise, thousands of highly-valued startups have entered the field, and demand for machine learning talent shows no signs of leveling. Program graduates emerge uniquely prepared to excel in machine learning roles.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Arpan Chakraborty", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Arpan is a computer scientist with a PhD from North Carolina State University. He teaches at Georgia Tech (within the Masters in Computer Science program), and is a coauthor of the book Practical Graph Mining with R."}, {"name": "Mat Leonard", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mat is a former physicist, research neuroscientist, and data scientist. He did his PhD and Postdoctoral Fellowship at the University of California, Berkeley."}, {"name": "Luis Serrano", "job": "CURRICULUM LEAD", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Alexis Cook", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Alexis is an applied mathematician with a Masters in computer science from Brown University and a Masters in applied mathematics from the University of Michigan. She was formerly a National Science Foundation Graduate Research Fellow."}, {"name": "Jay Alammar", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jay is a software engineer, the founder of Qaym (an Arabic-language review site), and the Investment Principal at the Riyad Taqnia Fund, a $120 million venture capital fund focused on high-technology startups."}, {"name": "Sebastian Thrun", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As the founder and president of Udacity, Sebastian’s mission is to democratize education. He is also the founder of Google X, where he led projects including the Self-Driving Car, Google Glass and more."}, {"name": "Ortal Arel", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Ortal Arel is a former computer engineering professor. She holds a PhD in Computer Engineering from the University of Tennessee. Her doctoral research work was in the area of applied cryptography."}]},
{"title": "Full Stack Web Developer | Udacity", "description": "In this program, you’ll prepare for a job as a Full Stack Web Developer, and learn to create complex server-side web applications that use powerful relational databases to persistently store data. You’ll build applications that can support any front end, and scale to support hundreds of thousands of users.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Karl Krueger", "job": "Lead Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Karl is a Course Developer at Udacity. Before joining Udacity, Karl was a Site Reliability Engineer (SRE) at Google for eight years, building automation and monitoring to keep the world’s busiest web services online."}, {"name": "Lorenzo Brown", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Lorenzo has had a passion for education since his first experience teaching computer science at a summer camp during college. He has lived in Boston, Boise, Bethlehem, Jerusalem and Mexico City before making California home. Lorenzo enjoys traveling, cooking, and taking on do-it-yourself projects. He holds a degree in Mathematics with Computer Science from the Massachusetts Institute of Technology with a concentration in Middle Eastern Studies."}, {"name": "Mike Wales", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Michael is a self-taught full-stack web developer and open source advocate. Before joining Udacity, he spent over 10 years developing classified applications for some of the most demanding intelligence organizations in the world."}]},
{"title": "Statistics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "App Marketing | Udacity", "description": null, "image": null, "instructor": []},
{"title": "iOS Developer | Udacity", "description": "This Nanodegree program will prepare you to publish your first iOS app, whether you’re already a developer or relatively new to programming. In this program, you’ll learn to program in Swift, then create your first apps from scratch. You’ll build a portfolio you can present in interviews, learn mobile development fundamentals like design patterns, and tackle common technical interview questions to ultimately land a job as an iOS Developer.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Jarrod Parkes", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jarrod is an experienced iOS developer with a passion for reinventing how students learn. He holds a BS in Computer Science from the University of Alabama."}, {"name": "Gabrielle Miller-Messner", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Gabrielle earned her Ph.D. in Population Biology from UC Davis, where she discovered the joys of programming while analyzing DNA sequences. She has a background in teaching, and worked as an iOS Engineer before joining Udacity."}, {"name": "Kate Rotondo", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Kate is an iOS developer, speaker, author, and teacher who has spoken at conferences across the globe from AltConf in San Francisco to Mobile Central Europe in Poland. She also has hosted a podcast on work-life integration for parents in tech."}, {"name": "Owen LaRosa", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Owen is an iOS and Android app developer, and is the Student Experience Lead for iOS programs at Udacity. He graduated from the iOS Developer Nanodegree program in 2015."}]},
{"title": "Predictive Analytics for Business | Udacity", "description": "Business Analysts are in high demand. In this program, you’ll learn to apply predictive analytics and business intelligence to solve real-world business problems. You’ll do so by building fluency in two leading software packages: Alteryx, a tool that enables you to prepare and analyze data quickly; and Tableau, a powerful data visualization tool. Upon graduating from the program, you’ll be ready to apply for a wide array of Business Analyst roles.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Patrick Nussbaumer", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Patrick Nussbaumer is Technical Activation Director at Alteryx, Inc. Prior to Alteryx, Patrick has spent the past 20 years in a variety of roles focused on data analysis, telecommunications, and financial services industries"}, {"name": "Ben Burkholder", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Ben Burkholder is a senior solution engineer at Alteryx, Inc. In this role he works extensively with clients to help develop plans to solve complex business problems around data preparation, geospatial analysis, and predictive analytics"}, {"name": "Maureen Wolfson", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Maureen Wolfson is a Solution Engineer at Alteryx, Inc. She has more than 20 years of data analysis expertise specializing in data, customer and geospatial analysis."}, {"name": "Rod Light", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Rod Light is a Solutions Engineer Practice Lead at Alteryx, where he helps customers and prospects design data analytics solutions for their businesses using Alteryx."}, {"name": "Tony Moses", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Tony Moses is a Solutions Engineer at Alteryx, Inc. He works with customers to help develop plans to solve complex business problems around data preparation, geospatial analysis and predictive analytics."}]},
{"title": "Time Series Forecasting | Udacity", "description": null, "image": null, "instructor": []},
{"title": "VR Interview Prep | Udacity", "description": null, "image": null, "instructor": []},
{"title": "JavaScript Design Patterns | Udacity", "description": null, "image": null, "instructor": []},
{"title": "A/B Testing for Business Analysts | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Cyber-Physical Systems Design & Analysis | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Segmentation and Clustering | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Classification Models | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Creating an Analytical Dataset | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Artificial Intelligence | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Introduction to Operating Systems | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Problem Solving with Advanced Analytics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Model Building and Validation | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Educational Technology | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Linear Algebra Refresher Course | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Computational Photography | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Science Interview Prep | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Build Native Mobile Apps with Flutter | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Learn Swift Programming Syntax | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Developing Android Apps with Kotlin | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Kotlin Bootcamp for Programmers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Offline Web Applications | Udacity", "description": null, "image": null, "instructor": []},
{"title": "JavaScript Promises | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Client-Server Communication | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Front End Frameworks | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Web Accessibility | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Website Performance Optimization | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Responsive Web Design Fundamentals | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Responsive Images | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Web Tooling & Automation | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Building High Conversion Web Forms | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Auto Development | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Kotlin for Android Developers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Gradle for Android and Java | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Google Maps APIs | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Material Design for Android Developers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Browser Rendering Optimization | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Advanced Android App Development | Udacity", "description": null, "image": null, "instructor": []},
{"title": "UX Design for Mobile Developers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Basics: Data Storage | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Developing Android Apps | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Basics: Multiscreen Apps | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Basics: User Input | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Basics: User Interface | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Descriptive Statistics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Performance | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Software Architecture & Design | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Basics: Networking | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Progressive Web Apps | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Introduction to Computer Vision | Udacity", "description": null, "image": null, "instructor": []},
{"title": "How to Install Android Studio | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Get Your Startup Started | Udacity", "description": null, "image": null, "instructor": []},
{"title": "How to Use Git and GitHub | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Writing READMEs | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to JavaScript | Udacity", "description": null, "image": null, "instructor": []},
{"title": "UIKit Fundamentals | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Health Informatics in the Cloud | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Software Development Process | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Xcode Debugging | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Big Data Analytics in Healthcare | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Analysis with R | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Hadoop and MapReduce | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Rapid Prototyping | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Object-Oriented JavaScript | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Machine Learning: Unsupervised Learning | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Scalable Microservices with Kubernetes | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Localization Essentials | Udacity", "description": null, "image": null, "instructor": []},
{"title": "How to Make an iOS App | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to DevOps | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Reinforcement Learning | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Linux Command Line Basics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to iOS App Development with Swift | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Grand Central Dispatch (GCD) | Udacity", "description": null, "image": null, "instructor": []},
{"title": "JavaScript Testing | Udacity", "description": null, "image": null, "instructor": []},
{"title": "App Monetization | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Structures & Algorithms in Python | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Product Design | Udacity", "description": null, "image": null, "instructor": []},
{"title": "GitHub & Collaboration | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Knowledge-Based AI: Cognitive Systems | Udacity", "description": null, "image": null, "instructor": []},
{"title": "iOS Networking with Swift | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Machine Learning for Trading | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Information Security | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Visualization and D3.js | Udacity", "description": null, "image": null, "instructor": []},
{"title": "How to Make a Platformer Using libGDX | Udacity", "description": null, "image": null, "instructor": []},
{"title": "2D Game Development with libGDX | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Engagement & Monetization | Mobile Games | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Analysis and Visualization | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Designing RESTful APIs | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Introduction to Graduate Algorithms | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Human-Computer Interaction | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Computer Networking | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Real-Time Analytics with Apache Storm | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Data Science | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Mobile Design and Usability for Android | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Passwordless Login Solutions for Android | Udacity", "description": null, "image": null, "instructor": []},
{"title": "ES6 - JavaScript Improved | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Firebase Analytics: iOS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Firebase Analytics: Android | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Software Analysis & Testing | Udacity", "description": null, "image": null, "instructor": []},
{"title": "High Performance Computing | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Configuring Linux Web Servers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "HTML5 Canvas | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Object Oriented Programming in Java | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Authentication & Authorization: OAuth | Udacity", "description": null, "image": null, "instructor": []},
{"title": "HTTP & Web Servers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Java Programming Basics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "iOS Persistence and Core Data | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Machine Learning | Udacity", "description": null, "image": null, "instructor": []},
{"title": "A/B Testing | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Cyber-Physical Systems Security | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Networking for Web Developers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Deploying Applications with Heroku | Udacity", "description": null, "image": null, "instructor": []},
{"title": "The MVC Pattern in Ruby | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Dynamic Web Applications with Sinatra | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Full-Stack Interview Prep | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Front-End Interview Prep | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Optimize Your GitHub | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to jQuery | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Craft Your Cover Letter | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Refresh Your Resume | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Strengthen Your LinkedIn Network & Brand | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Interview Prep | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Become a Data Engineer | Udacity", "description": "In this program, you’ll develop the skills and knowledge you need to join the rapidly growing data engineering field. With the help of expert instructors and mentors, you’ll design data models, build data warehouses and data lakes, automate data pipelines, and work with Big Data. These skills are in high demand and companies are facing major shortages of data engineering talent. Upon completing the program, you’ll have the skills you need to become a data engineer.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": []},
{"title": "Advanced Operating Systems | Udacity", "description": null, "image": null, "instructor": []},
{"title": "iOS Interview Prep | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Shell Workshop | Udacity", "description": null, "image": null, "instructor": []},
{"title": "SQL for Data Analysis | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Inferential Statistics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "C++ For Programmers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Relational Databases | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Network Security | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Compilers: Theory and Practice | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Data Analysis | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Database Systems Concepts & Design | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Deep Learning with PyTorch | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to TensorFlow for Deep Learning | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Embedded Systems | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Backend | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Introduction to Cybersecurity | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Point & Click App Development | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Version Control with Git | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Machine Learning | Udacity", "description": null, "image": null, "instructor": []},
{"title": "JavaScript and the DOM | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Introduction to Python Programming | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Learn ARKit using Unity | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Learn ARKit using Swift | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to AJAX | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Asynchronous JavaScript Requests | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Mobile Design and Usability for iOS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Server-Side Swift | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Passwordless Login Solutions for iOS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Swift for Developers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Eigenvectors and Eigenvalues | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Core ML: Machine Learning for iOS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "AutoLayout | Udacity", "description": null, "image": null, "instructor": []},
{"title": "VR Scenes and Objects | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Introduction to Virtual Reality | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Structures & Algorithms in Swift | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Swift for Beginners | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Visualization in Tableau | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Deploying a Hadoop Cluster | Udacity", "description": null, "image": null, "instructor": []},
{"title": "VR Software Development | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Objective-C for Swift Developers | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Machine Learning Interview Preparation | Udacity", "description": null, "image": null, "instructor": []},
{"title": "GT - Refresher - Advanced OS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Full Stack Foundations | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Computability, Complexity & Algorithms | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Programming Foundations with Python | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Firebase in a Weekend: Android | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Firebase in a Weekend: iOS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Data Wrangling with MongoDB | Udacity", "description": null, "image": null, "instructor": []},
{"title": "High Performance Computer Architecture | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to HTML and CSS | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Programming | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Psychology | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Physics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "OMSCS Student Orientation | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Statistics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Theoretical Computer Science | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Interactive 3D Graphics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to the Design of Everyday Things | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Artificial Intelligence | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Artificial Intelligence for Robotics | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Applied Cryptography | Udacity", "description": null, "image": null, "instructor": []},
{"title": "How to Build a Startup | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Programming Languages | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Software Debugging | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Software Testing | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Differential Equations in Action | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Algorithms | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Design of Computer Programs | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Intro to Computer Science | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Tales from the Genome | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Self-Driving Fundamentals: Featuring Apollo  | Udacity", "description": null, "image": null, "instructor": []},
{"title": "Android Developer | Udacity", "description": "We built this Nanodegree program in partnership with Google specifically to support aspiring Android Developers. The curriculum is designed to transform those with intermediate skills and a working knowledge of Java development best practices into specialists with the Android platform. Successful completion of the program means a diverse portfolio of projects to show employers, an established credential to affirm your achievements, and your own app on the Google Play Store. If your goal is employment as an Android Developer, this program is exactly what you need to succeed.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "James Williams", "job": "CURRICULUM LEAD", "image": "/assets/iridium/images/shared/placeholder.png", "description": "James Williams is the Android Curriculum Lead at Udacity, where he also creates Web development courses. He is the author of “HTML5 Game Programming,” and runs obstacle course/adventure races in his spare time."}, {"name": "Reto Meier", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Reto Meier has been part of Android Developer Relations at Google since 2009, and leads Google’s Scalable Developer Advocacy team. He is the author of the “Professional Android Application Development” book series from Wrox."}, {"name": "Dan Galpin", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Dan Galpin is a Developer Advocate for Android at Google, focusing on Android performance tuning, developer training, and games. He has over 10 years of experience in mobile, developing at almost every layer of the phone stack."}, {"name": "Jocelyn Becker", "job": "SENIOR PROGRAM MANAGER", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jocelyn Becker wrote the developer documentation for the first external Google API in 2004, and has been teaching developers to use Google APIs and technologies ever since. She has managed the creation of many of the Android courses built by Google and Udacity."}, {"name": "Katherine Kuan", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Katherine Kuan, formerly a Developer Advocate at Google, was a software engineer on the Android Apps team for Google Keep, Google Play, and the People app."}, {"name": "Lyla Fujiwara", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Lyla Fujiwara is an Android Developer Advocate at Google. Prior to joining Google, Lyla worked at Udacity on the Android Developer and Android Basics Nanodegree teams. She’s taught on three continents and is a former Peace Corps volunteer."}, {"name": "Jennie Kim Eldon", "job": "PRODUCT LEAD", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jennie Kim Eldon is the Product Lead for Android and iOS Nanodegree programs at Udacity, where she previously worked as a software engineer. Before Udacity, she served at the US State Department, leading programs for women and girls in Afghanistan."}, {"name": "Jessica Lin", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jessica Lin is the Android Basics Curriculum Lead at Udacity, teaching various aspects of the Android development ecosystem. When untethered from her devices, she can be found training for her next Muay Thai competition."}, {"name": "Asser Samak", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Asser Samak is a Content Developer at Udacity, with over 9 years experience in software engineering, and a great passion for teaching. He also teaches Udacity’s Java course series."}, {"name": "Nikita Gamolsky", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Nikita Gamolsky was an early graduate of the Udacity Android Developer Nanodegree program. Since then, he’s joined the Google Developer Training team to educate and inspire mobile developers around the world."}, {"name": "Cezanne Camacho", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is an expert in computer vision with an M.S. in Electrical Engineering from Stanford University. Inspired by anyone with the drive and imagination to learn something new, she aims to create more inclusive and effective STEM education."}, {"name": "Jeremy Silver", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jeremy Silver writes Android games, loves automating repetitive tasks, and is determined to take all the mystery out of programming. You can catch him on the ski slopes, falling out of planes, or hacking away into the wee hours."}, {"name": "Jose Nieto", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jose Nieto became an Android Developer after graduating from the Android Nanodegree program. He is now a Content Developer at Udacity, where he builds learning experiences for thousands of future Android Developers worldwide."}]},
{"title": "Natural Language Processing | Udacity", "description": "Over the course of this program, you’ll become an expert in the main components of Natural Language Processing, including speech recognition, sentiment analysis, and machine translation. You’ll learn to code probabilistic and deep learning models, train them on real data, and build a career-ready portfolio as an NLP expert!", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Luis Serrano", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in Mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Jay Alammar", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jay has a degree in computer science, loves visualizing machine learning concepts, and is the Investment Principal at STV, a $500 million venture capital fund focused on high-technology startups."}, {"name": "Arpan Chakraborty", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Arpan is a computer scientist with a PhD from North Carolina State University. He teaches at Georgia Tech (within the Masters in Computer Science program), and is a coauthor of the book Practical Graph Mining with R."}, {"name": "Dana Sheahen", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Dana is an electrical engineer with a Masters in Computer Science from Georgia Tech. Her work experience includes software development for embedded systems in the Automotive Group at Motorola, where she was awarded a patent for an onboard operating system."}]},
{"title": "Computer Vision | Udacity", "description": "From computer graphics to social robotics to autonomous vehicles, computer vision is powering world-changing new technologies. In this program, you’ll write code to perform everything from facial recognition to scene-understanding to object tracking; by the end of this program, you’ll have a broad portfolio of applications that you’ve built!", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Sebastian Thrun", "job": "Udacity President", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sebastian Thrun is a scientist, educator, inventor, and entrepreneur. Prior to founding Udacity, he launched Google’s self-driving car project."}, {"name": "Cezanne Camacho", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is an expert in computer vision with a Masters in Electrical Engineering from Stanford University. As a former researcher in genomics and biomedical imaging, she’s applied computer vision and deep learning to medical diagnostic applications."}, {"name": "Alexis Cook", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Alexis is an applied mathematician with a Masters in computer science from Brown University and a Masters in applied mathematics from the University of Michigan. She was formerly a National Science Foundation Graduate Research Fellow."}, {"name": "Juan Delgado", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Juan is a computational physicist with a Masters in Astronomy. He is finishing his PhD in Biophysics. He previously worked at NASA developing space instruments and writing software to analyze large amounts of scientific data using machine learning techniques."}, {"name": "Jay Alammar", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jay has a degree in computer science, loves visualizing machine learning concepts, and is the Investment Principal at STV, a $500 million venture capital fund focused on high-technology startups."}, {"name": "Ortal Arel", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Ortal Arel has a PhD in Computer Engineering, and has been professor and researcher in the field of applied cryptography and embedded platforms. She has worked on design and analysis of intelligent algorithms for high-speed custom digital architectures."}, {"name": "Luis Serrano", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in Mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}]},
{"title": "Android Basics | Udacity", "description": "Want to learn Android programming basics, but don’t know where to start? In this Nanodegree program, we’ll show you the way. We developed this curriculum with Google for true beginners interested in developing apps for the next billion Android users!", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Katherine Kuan", "job": "CURRICULUM DIRECTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Katherine Kuan, formerly a Developer Advocate at Google, was a software engineer on the Android Apps team for Google Keep, Google Play, and the People app."}, {"name": "Jessica Lin", "job": "CURRICULUM LEAD", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jessica Lin is the Android Basics Curriculum Lead at Udacity, teaching various aspects of the Android development ecosystem. When untethered from her devices, she can be found training for her next Muay Thai competition."}, {"name": "Jennie Kim Eldon", "job": "PRODUCT LEAD", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jennie Kim Eldon is the Product Lead for Android and iOS Nanodegree programs at Udacity, where she previously worked as a software engineer. Before Udacity, she served at the US State Department, leading programs for women and girls in Afghanistan."}, {"name": "Asser Samak", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Asser Samak is a Content Developer at Udacity, with over 9 years experience in software engineering, and a great passion for teaching. He also teaches Udacity’s Java course series."}, {"name": "Lyla Fujiwara", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Lyla Fujiwara is an Android Developer Advocate at Google. Prior to joining Google, Lyla worked at Udacity on the Android Developer and Android Basics Nanodegree teams. She’s taught on three continents and is a former Peace Corps volunteer."}, {"name": "Joe Lewis", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Joe Lewis has been working with Google Analytics since 2014, and is an author of several books on web development. He is also a professionally-trained classical bassist with a masters degree from New England Conservatory and an avid mountain biker."}, {"name": "Vicky Tu", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Vicky Tu is a Course Manager for Android Basics at Udacity, and an Android app developer. In her free time, she enjoys playing with dogs and dancing."}, {"name": "Chris Lei", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Chris is inspired and humbled by all who embrace computing as a medium to realize their dreams. He holds an M.S in Embedded Systems and a B.S in Computer Engineering."}]},
{"title": "Artificial Intelligence | Udacity", "description": "Learn from the world’s foremost AI experts, and develop a deep understanding of algorithms being applied to real-world problems in natural language processing, computer vision, bioinformatics, and more. Practice a structured approach for applying these techniques to new challenges, and emerge fully prepared to advance in the field.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Peter Norvig", "job": "Research Director, Google", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Peter Norvig is a Director of Research at Google and is co-author of Artificial Intelligence: A Modern Approach, the leading textbook in the field."}, {"name": "Sebastian Thrun", "job": "Founder, Udacity", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sebastian Thrun is a scientist, educator, inventor, and entrepreneur. Prior to founding Udacity, he launched Google’s self-driving car project."}, {"name": "Thad Starner", "job": "Professor of Computer Science, Georgia Tech", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Thad Starner is the director of the Contextual Computing Group (CCG) at Georgia Tech and is also the longest-serving Technical Lead/Manager on Google's Glass project."}]},
{"title": "Artificial Intelligence for Trading | Udacity", "description": "In this program, you’ll analyze real data and build financial models for trading. Whether you want to pursue a new job in finance, launch yourself on the path to a quant trading career, or master the latest AI applications in quantitative finance, this program offers you the opportunity to master valuable data and AI skills.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Cindy Lin", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cindy is a quantitative analyst with experience working for financial institutions such as Bank of America Merrill Lynch, Morgan Stanley, and Ping An Securities. She has an MS in Computational Finance from Carnegie Mellon University."}, {"name": "Arpan Chakraborty", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Arpan is a computer scientist with a PhD from North Carolina State University. He teaches at Georgia Tech (within the Masters in Computer Science program), and is a coauthor of the book Practical Graph Mining with R."}, {"name": "Elizabeth Otto Hamel", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Elizabeth received her PhD in Applied Physics from Stanford University, where she used optical and analytical techniques to study activity patterns of large ensembles of neurons. She formerly taught data science at The Data Incubator."}, {"name": "Eddy Shyu", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Eddy has worked at BlackRock, Thomson Reuters, and Morgan Stanley, and has an MS in Financial Engineering from HEC Lausanne. Eddy taught data analytics at UC Berkeley and contributed to Udacity’s Self-Driving Car program."}, {"name": "Brok Bucholtz", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Brok has a background of over five years of software engineering experience from companies like Optimal Blue. Brok has built Udacity projects for the Self Driving Car, Deep Learning, and AI Nanodegree programs."}, {"name": "Parnian Barekatain", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Parnian is a self-taught AI programmer and researcher. Previously, she interned at OpenAI on multi-agent Reinforcement Learning and organized the first OpenAI hackathon. She also runs a ShannonLabs fellowship to support the next generation of independent researchers."}, {"name": "Juan Delgado", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Juan is a computational physicist with a Masters in Astronomy. He is finishing his PhD in Biophysics. He previously worked at NASA developing space instruments and writing software to analyze large amounts of scientific data using machine learning techniques."}, {"name": "Luis Serrano", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Cezanne Camacho", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is an expert in computer vision with a Masters in Electrical Engineering from Stanford University. As a former researcher in genomics and biomedical imaging, she’s applied computer vision and deep learning to medical diagnostic applications."}, {"name": "Mat Leonard", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mat is a former physicist, research neuroscientist, and data scientist. He did his PhD and Postdoctoral Fellowship at the University of California, Berkeley."}]},
{"title": "Deep Reinforcement Learning | Udacity", "description": "Deep reinforcement learning is one of AI’s hottest fields. Researchers, engineers, and investors are excited by its world-changing potential. In this advanced program, you’ll master techniques like Deep Q-Learning and Actor-Critic Methods, and connect with experts from NVIDIA and Unity as you build a portfolio of your own reinforcement learning projects.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Alexis Cook", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Alexis is an applied mathematician with a Masters in Computer Science from Brown University and a Masters in Applied Mathematics from the University of Michigan. She was formerly a National Science Foundation Graduate Research Fellow."}, {"name": "Arpan Chakraborty", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Arpan is a computer scientist with a PhD from North Carolina State University.  He teaches at Georgia Tech (within the Masters in Computer Science program), and is a coauthor of the book Practical Graph Mining with R."}, {"name": "Mat Leonard", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mat is a former physicist, research neuroscientist, and data scientist.  He did his PhD and Postdoctoral Fellowship at the University of California, Berkeley."}, {"name": "Luis Serrano", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Luis was formerly a Machine Learning Engineer at Google. He holds a PhD in Mathematics from the University of Michigan, and a Postdoctoral Fellowship at the University of Quebec at Montreal."}, {"name": "Cezanne Camacho", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is an expert in computer vision with a Masters in Electrical Engineering from Stanford University. As a former researcher in genomics and biomedical imaging, she’s applied computer vision and deep learning to medical diagnostic applications."}, {"name": "Dana Sheahen", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Dana is an electrical engineer with a Masters in Computer Science from Georgia Tech. Her work experience includes software development for embedded systems in the Automotive Group at Motorola, where she was awarded a patent for an onboard operating system."}, {"name": "Chhavi Yadav", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Chhavi is a Computer Science graduate student at New York University, where she researches machine learning algorithms. She is also an electronics engineer and has worked on wireless systems."}, {"name": "Juan Delgado", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Juan is a computational physicist with a Masters in Astronomy. He is finishing his PhD in Biophysics. He previously worked at NASA developing space instruments and writing software to analyze large amounts of scientific data using machine learning techniques."}, {"name": "Miguel Morales", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Miguel is a software engineer at Lockheed Martin. He earned a Masters in Computer Science at Georgia Tech and is an Instructional Associate for the Reinforcement Learning and Decision Making course. He’s the author of Grokking Deep Reinforcement Learning."}]},
{"title": "Flying Car and Autonomous Flight Engineer Nanodegree | Udacity", "description": "In this program, you’ll learn from world-class experts and write aircraft-ready code. You’ll master controls, planning, estimation, and more. In an increasingly congested world, flying cars look to the skies to provide smart transportation solutions that benefit us all.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Nicholas Roy", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Nicholas Roy is a Professor in the Department of Aeronautics & Astronautics, and a member of the Computer Science and Artificial Intelligence Laboratory, at MIT. He also founded Project Wing at X."}, {"name": "Angela Schoellig", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Angela is an Assistant Professor at the University of Toronto Institute for Aerospace Studies (UTIAS), and an Associate Director of the Center for Aerial Robotics Research and Education (CARRE) at the University of Toronto."}, {"name": "Sebastian Thrun", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As the founder and president of Udacity, Sebastian’s mission is to democratize education. He is also the founder of Google X, where he led projects including the Self-Driving Car, Google Glass, and more."}, {"name": "Raffaello D’Andrea", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Raffaello is a Professor of Dynamic Systems and Control at the Swiss Federal Institute of Technology (ETH) in Zurich. He is also the founder of Verity Studios, and a co-founder of Kiva Systems (now Amazon Robotics)."}, {"name": "Sergei Lupashin", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sergei has a PhD in MechE from ETH Zurich and a BS in ECE from Cornell. He brings experience from projects such as industrial drones, self-driving cars and controls testbeds. He is a TED Fellow and founder of Fotokite."}, {"name": "Jake Lussier", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jake is a PhD Candidate in AI at Stanford University focused on robotics, perception, and human-centered design. Prior to serving as Product Lead at Udacity, he founded an early-stage food-technology startup and consulted on flying cars."}, {"name": "Andy Brown", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andy has a bachelor's degree in physics from MIT, and taught himself to program after college (mostly with Udacity courses). He has been helping Udacity make incredible educational experiences since the early days of the company."}]},
{"title": "Google Ads | Udacity", "description": "Nearly 80 billion dollars was spent on Google Ads in 2016. This Google Ads course offers the opportunity to master this critical skill by running real campaigns. As a graduate, you’ll be uniquely prepared to succeed at an agency, go freelance, or join a startup. You’ll also be ready to earn ", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Anke Audenaert", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Anke leads the "}, {"name": "Gloria Yen", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Gloria is the content developer for the Google Ads Nanodegree program. She has been an account strategist at Google, the Google Marketing Manager at a digital agency, and worked as a customer success manager at a tech startup."}, {"name": "Daniel Kob", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Dan leads Business Operations at Udacity. He has an MBA from Stanford. He was previously an Entrepreneur-in-Residence at Bertelsmann, has worked at a mobile marketing tech startup, and has served clients in various agency roles."}, {"name": "Jaimee Arnobit", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jaimee is a program specialist for the Digital Marketing Nanodegree Program. She has previously been an account executive and marketing analyst, managing online campaigns at a digital marketing agency. She is Google Ads certified."}]},
{"title": "Learn Unreal VR Foundations | Udacity", "description": "Unreal Engine 4 (UE4) is used by more AAA game studios than any other engine. It is a critical addition to your skillset. Our curriculum is built in collaboration with Epic Games, creators of Unreal Engine. This is the ideal program to master UE4 and Blueprint, its easy-to-learn, easy-to-use visual scripting language.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Joe Radak", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Joe Radak is a game and level designer, with a degree in Planetary Sciences and Astronomy from Penn State University. He has previously designed two Unreal Engine 4 VR titles, Light Repair Team #4 and Fruit for the Village."}]},
{"title": "Google Analytics | Udacity", "description": "Google Analytics is one of the most widely-used business tools in the world, and as a highly proficient user, you’ll be in demand, and able to power growth by leveraging your invaluable skills. Build fluency with Google Tag Manager and Data Studio, and learn to use advanced reporting techniques, analyze and optimize results, and produce actionable insights.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Feras Alhlou", "job": "Principal Consultant ", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Feras is Co-Founder of E-Nor, a digital analytics and marketing intelligence consultancy, and a leading Google Analytics Certified Partner. He has an extensive background in marketing and data intelligence and is a trusted advisor to some of the world's most recognized brands."}, {"name": "Eric Fettman", "job": "Analytics Coach", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Eric is an Analytics Instructor and Coach at E-Nor. In this role, he has worked with hundreds of participants at different stages of their careers.  He is also co-author of “Google Analytics Breakthrough: From Zero to Business Impact.”"}, {"name": "Damaris Lasa", "job": "Digital Analyst", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Damaris is a Certified Web Analyst and Sr. Digital Analytics Consultant at E-Nor. She helps Fortune 500 companies develop world-class analytics programs and has previously worked on advanced implementations for Ticketmaster, Fitbit, and Broadcom."}, {"name": "Scott Burnam", "job": "Digital Analyst", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Scott is a Digital Analytics Consultant at E-Nor, and brings to his work two decades of marketing experience in higher education, and as the owner of the Burnam Consulting Group."}, {"name": "Patrick Soch", "job": "Digital Analyst", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Patrick is a Digital Analytics Consultant at E-Nor, with two decades of experience managing search engine marketing campaigns for online retailers, premium brands, online travel sites, and higher education institutions."}, {"name": "Anke Audenaert", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Anke is the team lead for the Digital Marketing Nanodegree program at Udacity. She previously ran Market Research at Yahoo!, co-founded two companies, and is on the marketing faculty at UCLA Anderson."}]},
{"title": "Robotics Software Engineer | Udacity", "description": "In this program, you’ll learn core robotics skills necessary for success in the field: Localization, Mapping, Simultaneous Localization and Mapping (SLAM), Path Planning, and Navigation. You’ll implement these algorithms with C++, Robot Operating System (ROS), and the Gazebo simulator, and complete five hands-on projects to showcase your skills to hiring managers.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Sebastian Thrun", "job": "Udacity, President", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As the founder and president of Udacity, Sebastian’s mission is to democratize education. He is also the founder of Google X, where he led projects including the Self-Driving Car, Google Glass and more."}, {"name": "David Silver", "job": "School Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "David Silver leads the School of Autonomous Systems at Udacity. Before Udacity, David was a research engineer on the autonomous vehicle team at Ford. He has an MBA from Stanford, and a BSE in computer science from Princeton."}, {"name": "Karim Chamaa", "job": "Course Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Karim started his early career as a Mechanical Engineer. He earned his M.S. in Mechatronics and Robotics Engineering from NYU. His specialties include Kinematics, Control, and Electronics."}, {"name": "Julia Chernushevich", "job": "Course Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Julia is an experienced educator and robotics specialist. Her previous work experiences include teaching Mechatronics Engineering at the University of Waterloo and designing electric vehicles for underground mines."}]},
{"title": "Design Sprint Foundations | Udacity", "description": "Popularized in Jake Knapp’s bestseller “Sprint,” the Design Sprint process has revolutionized how products are brought to market. Design firm AJ&Smart has created a Version 2.0 to design products for Lufthansa, Zalando, Red Bull, and more. Now, Udacity and AJ&Smart are combining forces so you can master the problem-solving power of Design Sprints!", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Jonathan Courtney", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jonathan is a Product Designer and Co-Founder of AJ&Smart. Born in Ireland, he now works between Berlin and San Francisco, helping the best companies in the world make better products faster."}, {"name": "Michael Smart", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Michael is a Product Designer and Co-Founder of AJ&Smart. He has facilitated hundreds of Design Sprints with the world’s most innovative companies, designing award-winning products and services, while empowering teams to change the way they work."}, {"name": "Andrej Ktitarev", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andrej is a product designer at AJ&Smart. With a background in psychology and computer science, he has run Design Sprints and built different prototypes for various industries all over the world."}, {"name": "Anke Audenaert", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Anke is the product lead for the School of Business at Udacity.  She previously ran Market Research at Yahoo!, co-founded two companies, and is on the marketing faculty at UCLA Anderson."}, {"name": "Brittni Bowering", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Brittni is the Head of Media at AJ&Smart. She has a background in marketing and video advertising, and a passion for business. She has facilitated hundreds of Design Sprints across various industries."}]},
{"title": "Intro to Self-Driving Cars Nanodegree | Udacity", "description": "With just minimal programming experience, you can learn the essentials of building a self-driving car. You’ll discover how to solve problems in both Python and C++ as you explore what makes self-driving cars possible. Plus, graduates earn guaranteed admission into our career-ready Self-Driving Car Engineer Nanodegree program!", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Sebastian Thrun", "job": "Udacity President", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As the founder and president of Udacity, Sebastian’s mission is to democratize education. He is also the founder of Google X, where he led projects including the Self-Driving Car, Google Glass and more."}, {"name": "Andy Brown", "job": "Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andy has a bachelor's degree in physics from MIT, and taught himself to program after college (mostly with Udacity courses). He has been helping Udacity make incredible educational experiences since the early days of the company."}, {"name": "Cezanne Camacho", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cezanne is an expert in computer vision with an M.S. in Electrical Engineering from Stanford University. Inspired by anyone with the drive and imagination to learn something new, she aims to create more inclusive and effective STEM education."}, {"name": "Andrew Paster", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As an engineer, Andrew is excited to teach the technology of the future. With an engineering degree from Yale and years of tutoring experience, he strives to provide the most fulfilling learning experiences possible."}, {"name": "Anthony Navarro", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Anthony is a US Army combat veteran with an M.S. in Computer Engineering from Colorado State University. Prior to being a Product Lead at Udacity, he was a Senior Software Engineer at Lockheed Martin in their Autonomous Systems R&D division."}, {"name": "Elecia White", "job": "Engineer, Author, Host", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Elecia is an embedded software engineer at Logical Elegance, Inc, the author of O’Reilly’s Making Embedded Systems, and host of the Embedded.fm podcast. She enjoys sharing her enthusiasm for engineering and devices."}, {"name": "Tarin Ziyaee", "job": "Voyage, Director of AI", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As the Director of Artificial Intelligence at Voyage Auto, Tarin works to deliver low-cost, self-driving taxis. He brings a total of 14 years experience in perception and deep neural networks working with companies such as Apple."}]},
{"title": "Blockchain Developer | Udacity", "description": "We built this program with an expert team of working Blockchain Developers, to ensure a hands-on learning experience that prioritizes job readiness. This is the most comprehensive curriculum available for learning the fundamental skills, tooling, mindset, and security best practices that are essential to becoming a Blockchain Developer.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Brandy Camacho", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Brandy is Curriculum Lead for the Blockchain Developer Nanodegree program. She was  previously a Lead Technical Project Manager for Udacity. She is the founder of Network Designs, specializing in architecting software solutions."}, {"name": "Jessica Lin", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Jessica holds a Biomedical Engineering degree from Cornell University. Prior to joining Udacity, she developed and deployed enterprise healthcare technologies. She has recently taught Android Development in our Nanodegree programs."}, {"name": "Joe Nyzio", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Joe Nyzio earned his degree in Neuroscience from Temple University. At Udacity, he's been a Content Developer on the Data Analyst, Tech Entrepreneur, and Business Analyst Nanodegree programs."}, {"name": "Rachna Ralhan", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Rachna holds a Bachelor's of Electrical Engineering and a Master's of Software Management. She brings years of software and hardware engineering experience and has previously worked for companies such as Intel, AMD, Cypress, and Xilinx Semiconductors."}, {"name": "PK Rasam", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "PK Rasam is Founder and Chief Blockchain Officer at LINCD, specializing in blockchain strategy and distributed ledger infrastructure services. PK’s focus is on creating the next breed of Crypto Machine Intelligence-based businesses."}, {"name": "Nik Kalyani", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Nik Kalyani is an entrepreneur and blockchain architect. He is the co-founder and CTO of WhenHub, creator of the Interface micro-contracts dApp. A Microsoft MVP, he is also the founder of TryCrypto and Walkstarter."}, {"name": "Elena Nadolinski", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Elena Nadolinski is currently heads down building a new privacy cryptocurrency. Previously she was a Software Engineer at Airbnb, Tilt and Microsoft. Elena graduated with a degree in Computer Science from Virginia Tech in 2014."}]},
{"title": "VR High-Immersion | Udacity", "description": "In this program, you’ll make the leap from VR generalist to in-demand specialist as a High-Immersion Developer. You’ll gain valuable experience building projects designed by industry experts at Google, Unity, and HTC, as you learn to develop for the Vive and Rift, use SteamVR and the Oculus SDK, and explore cross-platform development.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Christian Plagemann", "job": "Curriculum Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Christian co-founded the VR Team at Google, started the VR Nanodegree program at Udacity, and developed this VR curriculum together with our partners and the team."}, {"name": "Matt Sonic", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Matt is a serial entrepreneur, artist, engineer, and founder of SFVR. His specialties are: virtual reality, computer graphics, interaction design, and high-performance programming."}, {"name": "Austin McCasland", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Austin is a virtual reality user experience designer. His background is in interactive sculptural new media, and he has a Masters degree in Human-Computer Interaction from Carnegie Mellon University."}, {"name": "Sky Nite", "job": "Content Developer", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sky, also Head of Education at Upload VR, uses a combination of entrepreneurship, design, authorship, and engineering to create beneficial systems and media which will build cooperation towards an ever-improving future."}]},
{"title": "Data Analyst | Udacity", "description": "Successful Data Analysts have a unique set of skills, and represent important value to organizations eager to make data-powered business decisions. In this program, you’ll learn to use Python, SQL, and statistics to uncover insights, communicate critical findings, and create data-driven solutions. Demand for qualified Data Analysts continues to rise, and as a graduate of this program, you will be prepared to take on these roles.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Josh Bernhard", "job": "Data Analyst Curriculum Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Josh has been sharing his passion for data for nearly a decade at all levels of university, and as Lead Data Science Instructor at Galvanize. He's used data science for work ranging from cancer research to process automation."}, {"name": "Sebastian Thrun", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sebastian is the co-founder of Udacity and a professor at Stanford University. He’s a prominent figure in artificial intelligence where he’s known as the godfather of automated vehicles. Sebastian spends his time flying as president of Kitty Hawk."}, {"name": "Derek Steer", "job": "Data Analyst Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Derek is the CEO of Mode Analytics. He developed an analytical foundation at Facebook and Yammer and is passionate about sharing it with future analysts. He authored SQL School and is a mentor at Insight Data Science"}, {"name": "Juno Lee", "job": "Data Analyst Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "As a data scientist at Looplist, Juno built neural networks to analyze and categorize product images, a recommendation system to personalize shopping experiences for each user, and tools to generate insight into user behavior."}, {"name": "Mike Yi", "job": "Data Analyst Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Mike is a Content Developer with a multidisciplinary academic background, including math, statistics, physics, and psychology.Previously, he worked on Udacity's Data Analyst Nanodegree program as a support lead."}, {"name": "David Venturi", "job": "Data Analyst Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Formerly a chemical engineer and data analyst, David created a personalized data science master's program using online resources. He has studied hundreds of online courses and is excited to bring the best to Udacity students."}, {"name": "Sam Nelson", "job": "Product Lead", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Sam is the Product Lead for Udacity’s Data Analyst, Business Analyst, and Data Foundations programs. He’s worked as an analytics consultant on projects in several industries, and is passionate about helping others improve their data skills."}]},
{"title": "Front End Web Developer | Udacity", "description": "Demand for front end developers is widespread across every industry and continues to rise. By mastering the valuable skills taught in this program, you’ll be prepared for roles at a wide array of companies, from startups to global organizations. The projects you’ll build, and the portfolio you’ll develop, will provide ample evidence of your expertise.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Richard Kalehoff", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Richard is a Course Developer with a passion for teaching. He has a degree in computer science, and first worked for a nonprofit doing everything from front-end web development, to backend programming, to database and server management."}, {"name": "Pete LePage", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Pete is a developer advocate at Google and works to make the lives of web developers easier. Working on projects like Web Fundamentals and Google web developer videos, he's focused on ensuring that developers have the tools and skills they need to build great responsive sites and apps."}, {"name": "Peter Lubbers", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Peter Lubbers is a Program Manager at Google in the Chrome Developer Relations team and lives and breathes HTML5. He is the co-author of Pro HTML5 Programming (Apress) and the founder of the San Francisco HTML5 User Group, the largest HTML5 User Group in the world."}, {"name": "Andrew Wong", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Andrew is a Course Developer who enjoys making the world a better place through code. He first discovered his passion for teaching as an instructor at App Academy, and continues to enjoy empowering students to advance their education."}, {"name": "Michael Wales", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Michael is a self-taught full-stack web developer and open source advocate. Before joining Udacity, he spent over 10 years developing classified applications for some of the most demanding intelligence organizations in the world."}, {"name": "Julia Van Cleve", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Julia is a Content Developer at Udacity and was previously a middle school math teacher in San Jose, CA. She also dabbled in freelance web development, designing websites for small businesses in the Bay Area."}, {"name": "James Parkes", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "James received his degree in Computer Science and Mathematics, then went on to become a Udacity instructor in several programs. His personal mission is clear: to open the doors of opportunity for others by empowering them with excellent educational experiences."}, {"name": "Cameron Pittman", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Cameron lives and breathes web development as he creates programming courses at Udacity. He graduated with degrees in physics and astronomy from Vanderbilt University and a Master's in teaching from Belmont University."}, {"name": "Karl Krueger", "job": "Instructor", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Karl is a Course Developer at Udacity. Before joining Udacity, Karl was a Site Reliability Engineer (SRE) at Google for eight years, building automation and monitoring to keep the world's busiest web services online."}]},
{"title": "Introduction to Programming | Udacity", "description": "Programming knowledge is indispensable in today’s world, and learning to code is one of the most valuable and useful things you can do. Whether you’re launching a career, advancing a career, or just excited to learn a new skill, there is no time like the present to start learning, and this program offers everything you need to get up to speed—with no prior programming skills required.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": [{"name": "Karl Krueger", "job": "LEAD INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Karl is a Course Developer at Udacity. Before joining Udacity, Karl was a Site Reliability Engineer (SRE) at Google for eight years, building automation and monitoring to keep the world’s busiest web services online."}, {"name": "Kelly Howard", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Kelly is the Product Lead for the Web Development Nanodegree programs at Udacity."}, {"name": "Julia Van Cleve", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Julia Van Cleve is a Content Developer at Udacity and was previously a middle school math teacher in San Jose, CA. She also dabbled in freelance web development, designing websites for small businesses in the Bay Area."}, {"name": "James Parkes", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "James received his degree in Computer Science and Mathematics, then went on to become a Udacity instructor in several programs. His personal mission is clear: to open the doors of opportunity for others by empowering them with excellent educational experiences."}, {"name": "Richard Kalehoff", "job": "INSTRUCTOR", "image": "/assets/iridium/images/shared/placeholder.png", "description": "Richard is a Course Developer with a passion for teaching. He has a degree in computer science, and first worked for a nonprofit doing everything from front-end web development, to backend programming, to database and server management."}]},
{"title": "Become a Marketing Analytics Expert | Udacity", "description": "This program is for anyone who wishes to gain foundational data skills that apply to marketing. You’ll learn to collect, organize, and analyze data with Excel; build Excel models to analyze possible business outcomes, and visualize and communicate your findings using Tableau and Data Studio. You’ll also gain valuable skills in Google Analytics. With analysts in high demand, this program is an ideal choice whether you’re just getting started with marketing or data, are interested in applying data skills to your current role, or plan to pursue further studies or career goals.", "image": "/assets/iridium/images/shared/placeholder.png", "instructor": []},
{"title": "What is Programming? | Udacity", "description": null, "image": null, "instructor": []}
]